import z from 'zod'

export const userSchema = {
  email: z
    .email({
      error: issue => issue.input === undefined
        ? 'Електронна пошта є обов\'язковою'
        : 'Електронна пошта має бути дійсною',
    })
    .trim()
    .min(1, { error: 'Електронна пошта не може бути порожньою' })
    .max(254, { error: 'Електронна пошта має містити не більше 254 символів' }),

  username: z
    .string({
      error: issue => issue.input === undefined
        ? 'Логін є обов\'язковим'
        : 'Логін має бути рядком',
    })
    .trim()
    .min(2, { error: 'Логін має містити щонайменше 2 символи' })
    .max(24, { error: 'Логін має містити не більше 24 символів' })
    .regex(/^(?=.*[a-z])\w+$/i, { error: 'Логін містить недопустимі символи' }),

  name: z
    .string({
      error: issue => issue.input === undefined
        ? 'Ім\'я користувача є обов\'язковим'
        : 'Ім\'я користувача має бути рядком',
    })
    .trim()
    .min(2, { error: 'Ім\'я користувача має містити щонайменше 2 символи' })
    .max(32, { error: 'Ім\'я користувача має містити не більше 32 символів' })
    .regex(/^(?=.*[a-z])\w+$/i, { error: 'Ім\'я користувача містить недопустимі символи' }),

  surname: z
    .string({
      error: issue => issue.input === undefined
        ? 'Призвище користувача є обов\'язковим'
        : 'Призвище користувача має бути рядком',
    })
    .trim()
    .min(2, { error: 'Призвище користувача має містити щонайменше 2 символи' })
    .max(32, { error: 'Призвище користувача має містити не більше 32 символів' })
    .regex(/^(?=.*[a-z])\w+$/i, { error: 'Призвище користувача містить недопустимі символи' }),

  password: z
    .string({
      error: issue => issue.input === undefined
        ? 'Пароль є обов\'язковим'
        : 'Пароль має бути рядком',
    })
    .trim()
    .min(1, { error: 'Пароль не може бути порожнім' })
    .max(64, { error: 'Пароль має містити не більше 64 символів' }),
}
